---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue
source: html/41a46b18-2f65-89fa-c714-06caf3ae5933.htm
---
# ElectricalDemandFactorValue Properties

The demand factor for this demand factor value. For example, objects 1 to 3 can have 100% demand factor.
 In the example above, the demand factor will be 1.0.